import { Component } from '@angular/core';

interface FAQ {
  question: string;
  answer: string;
  open?: boolean;
}

@Component({
  selector: 'app-faq-section',
  templateUrl: './faq-section.component.html',
  styleUrls: ['./faq-section.component.css']
})
export class FaqSectionComponent {
  faqs: FAQ[] = [
    {
      question: 'كم وقت يحتاج هذا المجال؟',
      answer: 'الجلسة نفسها مدتها حوالي ساعة فقط،\n وسنشرح كيف يمكن البدء حتى مع وقت محدود.'
    },
    {
      question: 'هل سنطبق التداول بشكل مباشر؟',
      answer: 'نعم.\n في آخر جزء من الجلسة سنطبق التداول live خطوة بخطوة.'
    },
    {
      question: 'ماذا لو جرّبت الأونلاين بزنس من قبل ولم تنجح؟',
      answer: 'أغلب الناس يبدأوا لحالهم،\n بدون نظام واضح،\n وبدون شخص يوجّههم خطوة بخطوة.\nفيتشتتوا بين الفيديوهات والمعلومات المتناقضة\n وفي النهاية يتوقفوا بدون نتيجة.\nولهذا صممنا هذا التحدي\n حتى نختصر عليك الطريق ونبسط البداية قدر الإمكان.'
    },
    {
      question: 'ماذا لو لم أستطع حضور البث المباشر؟',
      answer: 'حاول أن تحضر بشكل مباشر،\n لأن التطبيق العملي سيكون أثناء الجلسة نفسها.'
    },
    {
      question: 'متى يبدأ التحدي؟',
      answer: 'يبدأ التحدي يوم 20/5 الساعة 9 مساءً بتوقيت مصر'
    },
    {
      question: 'هل التحدي مجاناً؟',
      answer: 'نعم، التحدي مجاني بالكامل 100% للحضور.'
    },
    {
      question: 'هل أحتاج أي خبرة سابقة؟',
      answer: 'لا.\n هذا التحدي مصمم للمبتدئين بالكامل، وسنشرح كل شيء خطوة بخطوة.'
    },
    {
      question: 'ماذا لو كنت لا أعرف أي شيء عن التداول؟',
      answer: 'هذا طبيعي جدًا.\n أغلب الأشخاص الذين يبدأون معنا لا يملكون أي خبرة مسبقة.'
    },
    {
      question: 'هل التداول حرام؟',
      answer: 'نحن نستخدم حسابات إسلامية خالية من الفوائد الربوية (Swap-Free)،\n ولا يوجد عليها أي فوائد تبييت أو معاملات ربوية.'
    },
    {
      question: 'هل أحتاج رأس مال كبير حتى أبدأ؟',
      answer: 'لا.\n يمكنك البدء بمبلغ بسيط والتطور خطوة بخطوة.'
    },
    {
      question: 'هل أستطيع البدء بجانب الوظيفة أو الدراسة؟',
      answer: 'نعم.\n أغلب الأشخاص الذين يحضرون التحدي هم طلاب أو موظفون.'
    }
  ];

  toggleFaq(index: number): void {
    this.faqs[index].open = !this.faqs[index].open;
  }
}
